web/webresources/nuevo.xhtml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:ser="http://service.sunat.gob.pe" xmlns:wsse="http://docs.oasisopen.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
 <soapenv:Header>
 <wsse:Security>
 <wsse:UsernameToken>
 <wsse:Username>20100066603MODDATOS</wsse:Username>
 <wsse:Password>moddatos</wsse:Password>
 </wsse:UsernameToken>
 </wsse:Security>
 </soapenv:Header>
 <soapenv:Body>
 <ser:sendBill>
 <fileName>20100066603-01-F001-1.zip</fileName>
 <contentFile>cid:20100066603-01-F001-1.zip</contentFile>
 </ser:sendBill>
 </soapenv:Body>
</soapenv:Envelope>

